I got the information [here](https://datacarpentry.org/python-ecology-lesson/03-index-slice-subset/)

In [ ]:
#!pip install pandas-datareader
#!pip install --upgrade pandas

In [ ]:
import gspread
import pandas as pd
from gspread_dataframe import get_as_dataframe, set_with_dataframe
from google.colab import auth
auth.authenticate_user()  # verify your account to read files which you have access to. Make sure you have permission to read the file!
from oauth2client.client import GoogleCredentials
gc = gspread.authorize(GoogleCredentials.get_application_default())

In [ ]:
spreadsheet = gc.open("Advertising") # Open file using its name. Use this if the file is already anywhere in your drive
csv =  spreadsheet.get_worksheet(0)     # 0 means the first sheet in the file
dframe = pd.DataFrame(csv.get_all_records())
dframe.head()

         TV  radio  newspaper  sales
0  1  230.1   37.8       69.2   22.1
1  2   44.5   39.3       45.1   10.4
2  3   17.2   45.9       69.3    9.3
3  4  151.5   41.3       58.5   18.5
4  5  180.8   10.8       58.4   12.9

In [ ]:
dframe[['TV','newspaper']]

        TV  newspaper
0    230.1       69.2
1     44.5       45.1
2     17.2       69.3
3    151.5       58.5
4    180.8       58.4
..     ...        ...
195   38.2       13.8
196   94.2        8.1
197  177.0        6.4
198  283.6       66.2
199  232.1        8.7

[200 rows x 2 columns]

In [ ]:
dframe.iloc[1:2, 0:3]

        TV  radio
1  2  44.5   39.3

In [ ]:
dframe.iloc[:,[2,4]]

     radio  sales
0     37.8   22.1
1     39.3   10.4
2     45.9    9.3
3     41.3   18.5
4     10.8   12.9
..     ...    ...
195    3.7    7.6
196    4.9    9.7
197    9.3   12.8
198   42.0   25.5
199    8.6   13.4

[200 rows x 2 columns]